zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_gpio.h
 /**    
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_gpio.h
  * @author  FMSH Application Team
  * @brief   Head file of GPIO FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_GPIO_H
#define __FM33FG0XXA_FL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"

/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_ES_INIT GPIO Exported Init structures
  * @{
  */

/**
  * @brief FL GPIO Init Sturcture definition
  */
typedef struct
{
    /* PIN*/
    uint32_t pin;

    /* 功能模式*/
    uint32_t mode;

    /* 输出类型*/
    uint32_t outputType;

    /* 驱动强度*/
    uint32_t driveStrength;

    /* 上拉/下拉选择使能*/
    uint32_t pull;

    /* 数字功能重定向*/
    uint32_t remapPin;

} FL_GPIO_InitTypeDef;

/**
  * @brief FL GPIO WKUP Init Sturcture definition
  */
typedef struct
{
    /* WKUP边沿选择 */
    uint32_t polarity;

} FL_WKUP_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_Exported_Constants GPIO Exported Constants
  * @{
  */

#define    GPIO_FCR_Pos                                           (0U)
#define    GPIO_FCR_Msk                                           (0x3U << GPIO_FCR_Pos)
#define    GPIO_FCR                                               GPIO_FCR_Msk

#define    GPIO_DFS_Pos                                           (0U)
#define    GPIO_DFS_Msk                                           (0x3U << GPIO_DFS_Pos)
#define    GPIO_DFS                                               GPIO_DFS_Msk

#define    GPIO_DSR_Pos                                           (0U)
#define    GPIO_DSR_Msk                                           (0x3U << GPIO_DSR_Pos)
#define    GPIO_DSR                                               GPIO_DSR_Msk

#define    GPIO_EXTIEDSA_Pos                                      (0U)
#define    GPIO_EXTIEDSA_Msk                                      (0x3U << GPIO_EXTIEDSA_Pos)
#define    GPIO_EXTIEDSA                                          GPIO_EXTIEDSA_Msk

#define    GPIO_EXTIEDSB_Pos                                      (0U)
#define    GPIO_EXTIEDSB_Msk                                      (0x3U << GPIO_EXTIEDSB_Pos)
#define    GPIO_EXTIEDSB                                          GPIO_EXTIEDSB_Msk

#define    GPIO_EXTIEDSC_Pos                                      (0U)
#define    GPIO_EXTIEDSC_Msk                                      (0x3U << GPIO_EXTIEDSC_Pos)
#define    GPIO_EXTIEDSC                                          GPIO_EXTIEDSC_Msk

#define    GPIO_EXTIEDSD_Pos                                      (0U)
#define    GPIO_EXTIEDSD_Msk                                      (0x3U << GPIO_EXTIEDSD_Pos)
#define    GPIO_EXTIEDSD                                          GPIO_EXTIEDSD_Msk

#define    GPIO_EXTIEDSE_Pos                                      (0U)
#define    GPIO_EXTIEDSE_Msk                                      (0x3U << GPIO_EXTIEDSE_Pos)
#define    GPIO_EXTIEDSE                                          GPIO_EXTIEDSE_Msk

#define    GPIO_EXTIEDSF_Pos                                      (0U)
#define    GPIO_EXTIEDSF_Msk                                      (0x3U << GPIO_EXTIEDSF_Pos)
#define    GPIO_EXTIEDSF                                          GPIO_EXTIEDSF_Msk

