zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_gpio.h
#define    GPIO_EXTIEDSG_Pos                                      (0U)
#define    GPIO_EXTIEDSG_Msk                                      (0x3U << GPIO_EXTIEDSG_Pos)
#define    GPIO_EXTIEDSG                                          GPIO_EXTIEDSG_Msk

#define    GPIO_EXTIEDSH_Pos                                      (0U)
#define    GPIO_EXTIEDSH_Msk                                      (0x3U << GPIO_EXTIEDSH_Pos)
#define    GPIO_EXTIEDSH                                          GPIO_EXTIEDSH_Msk

#define    GPIO_EXTIEDSI_Pos                                      (0U)
#define    GPIO_EXTIEDSI_Msk                                      (0x3U << GPIO_EXTIEDSI_Pos)
#define    GPIO_EXTIEDSI                                          GPIO_EXTIEDSI_Msk

#define    GPIO_EXTIDFAB_DFA_Pos                                  (0U)
#define    GPIO_EXTIDFAB_DFA_Msk                                  (0xffffU << GPIO_EXTIDFAB_DFA_Pos)
#define    GPIO_EXTIDFAB_DFA                                      GPIO_EXTIDFAB_DFA_Msk

#define    GPIO_EXTIDFAB_DFB_Pos                                  (16U)
#define    GPIO_EXTIDFAB_DFB_Msk                                  (0xffffU << GPIO_EXTIDFAB_DFB_Pos)
#define    GPIO_EXTIDFAB_DFB                                      GPIO_EXTIDFAB_DFB_Msk

#define    GPIO_EXTIDFCD_DFC_Pos                                  (0U)
#define    GPIO_EXTIDFCD_DFC_Msk                                  (0xffffU << GPIO_EXTIDFCD_DFC_Pos)
#define    GPIO_EXTIDFCD_DFC                                      GPIO_EXTIDFCD_DFC_Msk

#define    GPIO_EXTIDFCD_DFD_Pos                                  (16U)
#define    GPIO_EXTIDFCD_DFD_Msk                                  (0xffffU << GPIO_EXTIDFCD_DFD_Pos)
#define    GPIO_EXTIDFCD_DFD                                      GPIO_EXTIDFCD_DFD_Msk

#define    GPIO_EXTIDFEF_DFE_Pos                                  (0U)
#define    GPIO_EXTIDFEF_DFE_Msk                                  (0xffffU << GPIO_EXTIDFEF_DFE_Pos)
#define    GPIO_EXTIDFEF_DFE                                      GPIO_EXTIDFEF_DFE_Msk

#define    GPIO_EXTIDFEF_DFF_Pos                                  (16U)
#define    GPIO_EXTIDFEF_DFF_Msk                                  (0xffffU << GPIO_EXTIDFEF_DFF_Pos)
#define    GPIO_EXTIDFEF_DFF                                      GPIO_EXTIDFEF_DFF_Msk

#define    GPIO_EXTIDFGH_DFG_Pos                                  (0U)
#define    GPIO_EXTIDFGH_DFG_Msk                                  (0xffffU << GPIO_EXTIDFGH_DFG_Pos)
#define    GPIO_EXTIDFGH_DFG                                      GPIO_EXTIDFGH_DFG_Msk

#define    GPIO_EXTIDFGH_DFH_Pos                                  (16U)
#define    GPIO_EXTIDFGH_DFH_Msk                                  (0xffffU << GPIO_EXTIDFGH_DFH_Pos)
#define    GPIO_EXTIDFGH_DFH                                      GPIO_EXTIDFGH_DFH_Msk

#define    GPIO_EXTIDFI_DFI_Pos                                   (0U)
#define    GPIO_EXTIDFI_DFI_Msk                                   (0xffffU << GPIO_EXTIDFI_DFI_Pos)
#define    GPIO_EXTIDFI_DFI                                       GPIO_EXTIDFI_DFI_Msk

#define    GPIO_EXTIISRAB_ISRA_Pos                                (0U)
#define    GPIO_EXTIISRAB_ISRA_Msk                                (0xffffU << GPIO_EXTIISRAB_ISRA_Pos)
#define    GPIO_EXTIISRAB_ISRA                                    GPIO_EXTIISRAB_ISRA_Msk

#define    GPIO_EXTIISRAB_ISRB_Pos                                (16U)
#define    GPIO_EXTIISRAB_ISRB_Msk                                (0xffffU << GPIO_EXTIISRAB_ISRB_Pos)
#define    GPIO_EXTIISRAB_ISRB                                    GPIO_EXTIISRAB_ISRB_Msk

#define    GPIO_EXTIISRCD_ISRC_Pos                                (0U)
#define    GPIO_EXTIISRCD_ISRC_Msk                                (0xffffU << GPIO_EXTIISRCD_ISRC_Pos)
#define    GPIO_EXTIISRCD_ISRC                                    GPIO_EXTIISRCD_ISRC_Msk

#define    GPIO_EXTIISRCD_ISRD_Pos                                (16U)
#define    GPIO_EXTIISRCD_ISRD_Msk                                (0xffffU << GPIO_EXTIISRCD_ISRD_Pos)
#define    GPIO_EXTIISRCD_ISRD                                    GPIO_EXTIISRCD_ISRD_Msk

#define    GPIO_EXTIISREF_ISRE_Pos                                (0U)
#define    GPIO_EXTIISREF_ISRE_Msk                                (0xffffU << GPIO_EXTIISREF_ISRE_Pos)
#define    GPIO_EXTIISREF_ISRE                                    GPIO_EXTIISREF_ISRE_Msk

#define    GPIO_EXTIISREF_ISRF_Pos                                (16U)
#define    GPIO_EXTIISREF_ISRF_Msk                                (0xffffU << GPIO_EXTIISREF_ISRF_Pos)
#define    GPIO_EXTIISREF_ISRF                                    GPIO_EXTIISREF_ISRF_Msk

#define    GPIO_EXTIISRGH_ISRG_Pos                                (0U)
#define    GPIO_EXTIISRGH_ISRG_Msk                                (0xffffU << GPIO_EXTIISRGH_ISRG_Pos)
#define    GPIO_EXTIISRGH_ISRG                                    GPIO_EXTIISRGH_ISRG_Msk

#define    GPIO_EXTIISRGH_ISRH_Pos                                (16U)
#define    GPIO_EXTIISRGH_ISRH_Msk                                (0xffffU << GPIO_EXTIISRGH_ISRH_Pos)
#define    GPIO_EXTIISRGH_ISRH                                    GPIO_EXTIISRGH_ISRH_Msk

#define    GPIO_EXTIISRI_ISRI_Pos                                 (0U)
#define    GPIO_EXTIISRI_ISRI_Msk                                 (0xffffU << GPIO_EXTIISRI_ISRI_Pos)
#define    GPIO_EXTIISRI_ISRI                                     GPIO_EXTIISRI_ISRI_Msk

#define    GPIO_EXTDIAB_DIA_Pos                                   (0U)
#define    GPIO_EXTDIAB_DIA_Msk                                   (0xffffU << GPIO_EXTDIAB_DIA_Pos)
#define    GPIO_EXTDIAB_DIA                                       GPIO_EXTDIAB_DIA_Msk

#define    GPIO_EXTDIAB_DIB_Pos                                   (16U)
#define    GPIO_EXTDIAB_DIB_Msk                                   (0xffffU << GPIO_EXTDIAB_DIB_Pos)
#define    GPIO_EXTDIAB_DIB                                       GPIO_EXTDIAB_DIB_Msk

#define    GPIO_EXTDICD_DIC_Pos                                   (0U)
#define    GPIO_EXTDICD_DIC_Msk                                   (0xffffU << GPIO_EXTDICD_DIC_Pos)
#define    GPIO_EXTDICD_DIC                                       GPIO_EXTDICD_DIC_Msk

#define    GPIO_EXTDICD_DID_Pos                                   (16U)
#define    GPIO_EXTDICD_DID_Msk                                   (0xffffU << GPIO_EXTDICD_DID_Pos)
#define    GPIO_EXTDICD_DID                                       GPIO_EXTDICD_DID_Msk

#define    GPIO_EXTDIEF_DIE_Pos                                   (0U)
#define    GPIO_EXTDIEF_DIE_Msk                                   (0xffffU << GPIO_EXTDIEF_DIE_Pos)
#define    GPIO_EXTDIEF_DIE                                       GPIO_EXTDIEF_DIE_Msk

#define    GPIO_EXTDIEF_DIF_Pos                                   (16U)
#define    GPIO_EXTDIEF_DIF_Msk                                   (0xffffU << GPIO_EXTDIEF_DIF_Pos)
#define    GPIO_EXTDIEF_DIF                                       GPIO_EXTDIEF_DIF_Msk

#define    GPIO_EXTDIGH_DIG_Pos                                   (0U)
#define    GPIO_EXTDIGH_DIG_Msk                                   (0xffffU << GPIO_EXTDIGH_DIG_Pos)
#define    GPIO_EXTDIGH_DIG                                       GPIO_EXTDIGH_DIG_Msk

#define    GPIO_EXTDIGH_DIH_Pos                                   (16U)
#define    GPIO_EXTDIGH_DIH_Msk                                   (0xffffU << GPIO_EXTDIGH_DIH_Pos)
#define    GPIO_EXTDIGH_DIH                                       GPIO_EXTDIGH_DIH_Msk

#define    GPIO_EXTDII_DII_Pos                                    (0U)
#define    GPIO_EXTDII_DII_Msk                                    (0xffffU << GPIO_EXTDII_DII_Pos)
#define    GPIO_EXTDII_DII                                        GPIO_EXTDII_DII_Msk

